; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v2 ?v5)
             (pred_4 ?v1 ?v8)
             (pred_3 ?v2 ?v8)
             (pred_7 ?v9 ?v2 )
	     (pred_10 ?v2)
             (pred_8 ?v10)
             (pred_5 ?v1)
             (pred_11 ?v8)
             (pred_6 ?v2)
             (pred_1 ?v1)
             (pred_12 ?v2)
             (pred_2 ))



(:action op_1
:parameters (?v13 ?v3 ?v4 ?v7)
:precondition (and (pred_8 ?v13) (pred_8 ?v3) (pred_5 ?v4) (pred_11 ?v7)
          (pred_9 ?v13 ?v3) (pred_4 ?v4 ?v7)
                   (pred_3 ?v3 ?v7) (pred_10 ?v13) 
                   (pred_6 ?v3) (pred_1 ?v4))
:effect (and  (pred_12 ?v3) (not (pred_6 ?v3))))


(:action op_3
:parameters (?v13 ?v6)
:precondition (and (pred_8 ?v13) (pred_8 ?v6)
               (pred_10 ?v13) (pred_9 ?v13 ?v6) (pred_12 ?v6))
:effect (and (pred_10 ?v6) (not (pred_10 ?v13))))

(:action op_4
:parameters (?v13 ?v4)
:precondition (and (pred_8 ?v13) (pred_5 ?v4) 
                  (pred_10 ?v13) (pred_7 ?v4 ?v13) (pred_2 ))
:effect (and (pred_1 ?v4)
   (not (pred_7 ?v4 ?v13)) (not (pred_2 ))))


(:action op_5
:parameters (?v13 ?v11 ?v12)
:precondition (and (pred_8 ?v13) (pred_5 ?v11) (pred_5 ?v12)
                  (pred_10 ?v13) (pred_1 ?v12) (pred_7 ?v11 ?v13))
:effect (and (pred_1 ?v11) (pred_7 ?v12 ?v13)
        (not (pred_1 ?v12)) (not (pred_7 ?v11 ?v13))))

(:action op_2
:parameters (?v13 ?v4)
:precondition (and (pred_8 ?v13) (pred_5 ?v4) 
                  (pred_10 ?v13) (pred_1 ?v4))
:effect (and (pred_2 ) (pred_7 ?v4 ?v13) (not (pred_1 ?v4)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_20 obj_28 obj_12 obj_31 obj_06 obj_02 obj_03 obj_24 obj_13 obj_14 obj_01 obj_27 obj_22 obj_30 obj_11 obj_23 obj_17 obj_05 obj_26 obj_08 obj_29 obj_15 obj_25 obj_19 obj_09
    obj_10 obj_21 obj_07
    obj_18 obj_16 obj_04
    )

    (:init
       (pred_2)

       (pred_8 obj_20)
       (pred_8 obj_28)
       (pred_8 obj_12)
       (pred_8 obj_31)
       (pred_8 obj_06)
       (pred_8 obj_02)
       (pred_8 obj_03)
       (pred_8 obj_24)
       (pred_8 obj_13)
       (pred_8 obj_14)
       (pred_8 obj_01)
       (pred_8 obj_27)
       (pred_8 obj_22)
       (pred_8 obj_30)
       (pred_8 obj_11)
       (pred_8 obj_23)
       (pred_8 obj_17)
       (pred_8 obj_05)
       (pred_8 obj_26)
       (pred_8 obj_08)
       (pred_8 obj_29)
       (pred_8 obj_15)
       (pred_8 obj_25)
       (pred_8 obj_19)
       (pred_8 obj_09)
       (pred_11 obj_10)
       (pred_11 obj_21)
       (pred_11 obj_07)
       (pred_5 obj_18)
       (pred_5 obj_16)
       (pred_5 obj_04)

       (pred_9 obj_20 obj_02)
       (pred_9 obj_20 obj_28)
       (pred_9 obj_28 obj_03)
       (pred_9 obj_28 obj_12)
       (pred_9 obj_28 obj_20)
       (pred_9 obj_12 obj_24)
       (pred_9 obj_12 obj_31)
       (pred_9 obj_12 obj_28)
       (pred_9 obj_31 obj_13)
       (pred_9 obj_31 obj_06)
       (pred_9 obj_31 obj_12)
       (pred_9 obj_06 obj_14)
       (pred_9 obj_06 obj_31)
       (pred_9 obj_02 obj_01)
       (pred_9 obj_02 obj_03)
       (pred_9 obj_02 obj_20)
       (pred_9 obj_03 obj_27)
       (pred_9 obj_03 obj_24)
       (pred_9 obj_03 obj_28)
       (pred_9 obj_03 obj_02)
       (pred_9 obj_24 obj_22)
       (pred_9 obj_24 obj_13)
       (pred_9 obj_24 obj_12)
       (pred_9 obj_24 obj_03)
       (pred_9 obj_13 obj_30)
       (pred_9 obj_13 obj_14)
       (pred_9 obj_13 obj_31)
       (pred_9 obj_13 obj_24)
       (pred_9 obj_14 obj_11)
       (pred_9 obj_14 obj_06)
       (pred_9 obj_14 obj_13)
       (pred_9 obj_01 obj_23)
       (pred_9 obj_01 obj_27)
       (pred_9 obj_01 obj_02)
       (pred_9 obj_27 obj_17)
       (pred_9 obj_27 obj_22)
       (pred_9 obj_27 obj_03)
       (pred_9 obj_27 obj_01)
       (pred_9 obj_22 obj_05)
       (pred_9 obj_22 obj_30)
       (pred_9 obj_22 obj_24)
       (pred_9 obj_22 obj_27)
       (pred_9 obj_30 obj_26)
       (pred_9 obj_30 obj_11)
       (pred_9 obj_30 obj_13)
       (pred_9 obj_30 obj_22)
       (pred_9 obj_11 obj_08)
       (pred_9 obj_11 obj_14)
       (pred_9 obj_11 obj_30)
       (pred_9 obj_23 obj_29)
       (pred_9 obj_23 obj_17)
       (pred_9 obj_23 obj_01)
       (pred_9 obj_17 obj_15)
       (pred_9 obj_17 obj_05)
       (pred_9 obj_17 obj_27)
       (pred_9 obj_17 obj_23)
       (pred_9 obj_05 obj_25)
       (pred_9 obj_05 obj_26)
       (pred_9 obj_05 obj_22)
       (pred_9 obj_05 obj_17)
       (pred_9 obj_26 obj_19)
       (pred_9 obj_26 obj_08)
       (pred_9 obj_26 obj_30)
       (pred_9 obj_26 obj_05)
       (pred_9 obj_08 obj_09)
       (pred_9 obj_08 obj_11)
       (pred_9 obj_08 obj_26)
       (pred_9 obj_29 obj_15)
       (pred_9 obj_29 obj_23)
       (pred_9 obj_15 obj_25)
       (pred_9 obj_15 obj_17)
       (pred_9 obj_15 obj_29)
       (pred_9 obj_25 obj_19)
       (pred_9 obj_25 obj_05)
       (pred_9 obj_25 obj_15)
       (pred_9 obj_19 obj_09)
       (pred_9 obj_19 obj_26)
       (pred_9 obj_19 obj_25)
       (pred_9 obj_09 obj_08)
       (pred_9 obj_09 obj_19)
       (pred_6 obj_28)
       (pred_6 obj_17)
       (pred_6 obj_05)
       (pred_3  obj_28 obj_10)
       (pred_3  obj_17 obj_21)
       (pred_3  obj_05 obj_07)
       (pred_12 obj_20)
       (pred_12 obj_12)
       (pred_12 obj_31)
       (pred_12 obj_06)
       (pred_12 obj_02)
       (pred_12 obj_03)
       (pred_12 obj_24)
       (pred_12 obj_13)
       (pred_12 obj_14)
       (pred_12 obj_01)
       (pred_12 obj_27)
       (pred_12 obj_22)
       (pred_12 obj_30)
       (pred_12 obj_11)
       (pred_12 obj_23)
       (pred_12 obj_26)
       (pred_12 obj_08)
       (pred_12 obj_29)
       (pred_12 obj_15)
       (pred_12 obj_25)
       (pred_12 obj_19)
       (pred_12 obj_09)

       (pred_4  obj_18 obj_10)
       (pred_4  obj_16 obj_21)
       (pred_4  obj_04 obj_07)
       (pred_7 obj_18 obj_02)
       (pred_7 obj_16 obj_22)
       (pred_7 obj_04 obj_12)
       (pred_10 obj_08)
    )

    (:goal (and
       (pred_7 obj_04 obj_23)
    ))
(:constraints
  (always (not (pred_10 obj_24)))
)
)

; plan
1. (op_3 obj_08 obj_26)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_26)
   goals met: 0 of 1
2. (op_3 obj_26 obj_30)
   deleted: (pred_10 obj_26)
   added: (pred_10 obj_30)
   goals met: 0 of 1
3. (op_3 obj_30 obj_13)
   deleted: (pred_10 obj_30)
   added: (pred_10 obj_13)
   goals met: 0 of 1
4. (op_3 obj_13 obj_31)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_31)
   goals met: 0 of 1
5. (op_3 obj_31 obj_12)
   deleted: (pred_10 obj_31)
   added: (pred_10 obj_12)
   goals met: 0 of 1
6. (op_4 obj_12 obj_04)
   deleted: (pred_7 obj_04 obj_12) (pred_2)
   added: (pred_1 obj_04)
   goals met: 0 of 1
7. (op_3 obj_12 obj_31)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_31)
   goals met: 0 of 1
8. (op_3 obj_31 obj_13)
   deleted: (pred_10 obj_31)
   added: (pred_10 obj_13)
   goals met: 0 of 1
9. (op_3 obj_13 obj_30)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_30)
   goals met: 0 of 1
10. (op_3 obj_30 obj_22)
   deleted: (pred_10 obj_30)
   added: (pred_10 obj_22)
   goals met: 0 of 1
11. (op_3 obj_22 obj_27)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_27)
   goals met: 0 of 1
12. (op_3 obj_27 obj_01)
   deleted: (pred_10 obj_27)
   added: (pred_10 obj_01)
   goals met: 0 of 1
13. (op_3 obj_01 obj_23)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_23)
   goals met: 0 of 1
14. (op_2 obj_23 obj_04)
   deleted: (pred_1 obj_04)
   added: (pred_2) (pred_7 obj_04 obj_23)
   goals met: 1 of 1
